[
  {
    "time": 79,
    "date": "Apr 16, 2021",
    "headline": "Big week for Man Utd; Arsenal make statement against Prague; CL Review",
    "desc": "Manchester United victory over both Tottenham and Granada. Arsenal gets proper...",
    "url": "https://www.patreon.com/posts/big-week-for-man-50115792"
  },
  {
    "time": 28,
    "date": "Apr 2, 2021",
    "headline": "Arsenal struggle, Man United cruise in Europa. Juve drop points. PSG Neymar partnership questioned",
    "desc": "S3 E30(2): In this episode Akan, Labrell and Idin join host KG to discuss the Europa results: Arsenal...",
    "url": "https://www.patreon.com/posts/arsenal-struggle-49825865"
  },
  {
    "time": 28,
    "date": "Apr 2, 2021",
    "headline": "Champions League/Europa League Special: How will the English teams do? Who has the best/worst draw?",
    "desc": "Champions League Quarter Final Preview/Predictions and Europa League Quarter Final Preview/Predictions...",
    "url": "https://www.patreon.com/posts/champions-league-49540367"
  },
  {
    "time": 75,
    "date": "Apr 2, 2021",
    "headline": "No Olympics for USMNT; Who impressed on international break? Kun Farewell tour; Liverpool vs Arsenal",
    "desc": "S3 E30: In this episode KG is joined by Josh, B and Nah to discuss USMNT fall from the Olympics...",
    "url": "https://www.patreon.com/posts/no-olympics-for-49540163"
  },
  {
    "time": 58,
    "date": "Mar 12, 2021",
    "headline": "Should Juve drop CR7 or Pirlo? Time to question Klopp? Can Chelsea make top 4? North London Derby",
    "desc": "S3 E28: In this episode Josh, Marvin, B and M join host KG to discuss Juventus CR7 Pirlo dilemma...",
    "url": "https://www.patreon.com/posts/should-juve-drop-48661904"
  },
  {
    "time": 48,
    "date": "Mar 5, 2021",
    "headline": "Manchester City to win it all? Barcelona Comeback. Madrid Derby",
    "desc": "S3 E27: In this episode Pros, Akan and Labrell joins M to discuss Chelsea's statement win at...",
    "url": "https://www.patreon.com/posts/chelsea-vs-city-48371985"
  },
  {
    "time": 50,
    "date": "Feb 3, 2021",
    "headline": "Tuchel vs Jose, David Luiz double jeopardy, Marseille revolution",
    "desc": "S3 E22: In this episode Idin (Arsenal), Rohit (Everton) and KG (Chelsea) joins M (Manchester United) to ...",
    "url": "https://www.patreon.com/posts/tuchel-vs-jose-47455332"
  },
  {
    "time": 70,
    "date": "Jan 29, 2021",
    "headline": "Liverpool woes, Lampard sacking, Lukaku vs Zlatan",
    "desc": "S3 E19: In this episode, host Nah (Chelsea) is joined by M (Manchester United), Akan (Arsenal) and...",
    "url": "https://www.patreon.com/posts/liverpool-woes-46836790"
  },
  {
    "time": 75,
    "date": "Nov 20, 2020",
    "headline": "Jurgen Klopp, Could he lead the USMNT into World Cup 2020? Barcelona is a Mess-i",
    "desc": "S3 E9: In this episode B (Arsenal), Gabe (Arsenal), Idin (Arsenal) join host KG(Chelsea) to take a...",
    "url": "https://www.patreon.com/posts/jurgen-klopp-he-44136138"
  },
  {
    "time": 66,
    "date": "Sep 18, 2020",
    "headline": "Ramos an average defender? How long can Ole stay at the wheel?",
    "desc": " S3 E8: In this this episode Akan, Sesay, B and Nah joins M to discuss Pogba's world class status...",
    "url": "https://www.patreon.com/posts/ramos-average-at-43829791"
  }
]